# Итоговая контрольная работа по основному блоку

## Постановка задачи
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Стуктура программы
Программный код полность записан в файле Program.cs, в котором реализованы две функции **PrintArray** и **CreateNewArray**, и блок основного кода программы.

### Функция **CreateNewArray**
Основная функция программы, которая получает на вход исходный массив строк *array* и возвращает новый массив *newArray*. Для этого сначала с помощью цикла *for* считаем все элементы исходного массива *array*, длина которых не превышает 3. Результат подсчета записываем в переменную *newArrayLength*, которая будет длинной нового массива. После ее подсчета снова запускаем цикл *for*, в котором с помощью проверки условия записываем все элементы исходного массива *array*, длина которых не превышает 3, в новый массив *newArray*.   Блок-схема алгоритма, реализованного функцией **CreateNewArray**, представлена в файле diagram.png.

### Функция **PrintArray**
Служит для печати массивов. Печать реализована с помощью цикла *for* и метода **System.Console.Write**. Условные операторы используются для красивого вывода массива(добавления скобок или запятых в нужных местах).

### Основной блок программы
Включает в себя инициализацию и заполнение  исходного массива *array*, его печать(вызов функции **PrintArray**), а также печать нового массива, который возвращается функцией **CreateNewArray** с аргументом *array*.

## Запуск программы
Для запуска программы необходимо открыть в терминале папку проекта и набрать и выполнить команду dotnet run.